---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.Radius
source: html/6a8ce591-5c0b-4712-f847-58a2996c7b7e.htm
---
# Autodesk.Revit.DB.CylindricalHelix.Radius Property

The radius of the cylindrical helix.

## Syntax (C#)
```csharp
public double Radius { get; }
```